madnoda/stm32f4-glcd-logger/src/main.c
#include "stm32f4xx.h"
#include "platform_config.h"
#include "hw_config.h"
#include "stm32f4xx_dcmi.h"
#include "glcd.h"
#ifdef USE_KANJI
#include "libnkf.h"
#endif

const int stepY = 28;
const int offsetYC = 16;
// const int stepYA = 100;
const int stepYA = 66;
const int offsetYCA = 7;
const int offsetYH = 16+3;
const int offsetYL = 16+24;

uint8_t fifo[2000];
uint8_t fifoa1[2000];
uint8_t fifoa2[2000];
uint8_t fifoa3[2000];
uint16_t fifo_in;

void fifo_clear()
{
	int i;
	fifo_in = 0;
	for (i = 0;i < 2000;i++) {
		fifo[i] = 0;
		fifoa1[i] = 0;
		fifoa2[i] = 0;
		fifoa3[i] = 0;
	}
}

void gpioInit(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
//	DIN1:PC3 DIN2:PA0 DIN3:PA1 DIN4:PA2
//	DIN5:PA3 DIN6:PA6 DIN7:PA7 DIN8:PC4

	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB | 
							RCC_AHB1Periph_GPIOC , ENABLE);
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 |
								  GPIO_Pin_3 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

//	SW1:PB7  SW2:PB6  SW3:PB5  SW4:PA15
//	SW5:PA14 SW6:PA8  SW7:PC6  SW8:PC7

	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin =	GPIO_Pin_8 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin =	GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin =	GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
}

uint8_t getData(void)
{
//	DIN1:PC3 DIN2:PA0 DIN3:PA1 DIN4:PA2
//	DIN5:PA3 DIN6:PA6 DIN7:PA7 DIN8:PC4

	uint8_t pa,pc,r;
	pa = GPIO_ReadInputData(GPIOA);
	pc = GPIO_ReadInputData(GPIOC);
	r = (pa << 1) & 0x1e;
	r |= ((pa >> 1) & 0x60);
	r |= ((pc >> 3) & 0x01);
	r |= ((pc << 3) & 0x80);
	return r;
}

uint16_t divMS = 5;
uint16_t divC = 1;

void putdaSD(uint8_t,uint8_t,uint8_t,uint8_t);
extern uint8_t flgDATAKIND;

void getDataHandler(void)
{
	static uint16_t c = 1;
	if(--c) return;
	c = divC;
	fifo[fifo_in] = getData();
	if (fifo_in >= 2000)
		fifo_in = 0;

	if (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET) {
		fifoa1[fifo_in] = 0xff;
	} else {
		fifoa1[fifo_in] = ADC_GetConversionValue(ADC1) & 0x00ff;
		ADC_SoftwareStartConv(ADC1);
	}
	if (ADC_GetFlagStatus(ADC2, ADC_FLAG_EOC) == RESET){
		fifoa2[fifo_in] = 0xff;
	} else {
		fifoa2[fifo_in] = ADC_GetConversionValue(ADC2) & 0x00ff;
		ADC_SoftwareStartConv(ADC2);
	}
	if (ADC_GetFlagStatus(ADC3, ADC_FLAG_EOC) == RESET){
		fifoa3[fifo_in] = 0xff;
	} else {
		fifoa3[fifo_in] = ADC_GetConversionValue(ADC3) & 0x00ff;
		ADC_SoftwareStartConv(ADC3);
	}
	if (flgDATAKIND == 0)
		putdaSD(fifo[fifo_in],fifoa1[fifo_in],fifoa2[fifo_in],fifoa3[fifo_in]);
	fifo_in++;
	if (fifo_in >= 2000)
		fifo_in = 0;
}

uint8_t pushSW()
{
//	SW1:PB7  SW2:PB6  SW3:PB5  SW4:PA15
//	SW5:PA14 SW6:PA8  SW7:PC6  SW8:PC7
	static uint8_t oldR = 0;
	static uint8_t oldR2 = 0;
	uint8_t r2 = 0;
	uint8_t r = 0;
	if (! GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_7)) {
		if ((!(oldR & 0x01)) && (!(oldR2 & 0x01))) {
			r2 |= 0x01;
		}
		r |= 0x01;
	}
	if (! GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_6)) {
		if ((!(oldR & 0x02)) && (!(oldR2 & 0x02))) {
			r2 |= 0x02;
		}
		r |= 0x02;
	}
	if (! GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_5)) {
		if ((!(oldR & 0x04)) && (!(oldR2 & 0x04))) {
			r2 |= 0x04;
		}
		r |= 0x04;
	}
	if (! GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_15)) {
		if ((!(oldR & 0x08)) && (!(oldR2 & 0x08))) {
			r2 |= 0x08;
		}
		r |= 0x08;
	}
	if (! GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14)) {
		if ((!(oldR & 0x10)) && (!(oldR2 & 0x10))) {
			r2 |= 0x10;
		}
		r |= 0x10;
	}
	if (! GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8)) {
		if ((!(oldR & 0x20)) && (!(oldR2 & 0x20))) {
			r2 |= 0x20;
		}
		r |= 0x20;
	}
	if (! GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_6)) {
		if ((!(oldR & 0x40)) && (!(oldR2 & 0x40))) {
			r2 |= 0x40;
		}
		r |= 0x40;
	}
	if (! GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_7)) {
		if ((!(oldR & 0x80)) && (!(oldR2 & 0x80))) {
			r2 |= 0x80;
		}
		r |= 0x80;
	}
	oldR2 = oldR;
	oldR = r;
	return r2;
}

DWORD acc_size;
WORD acc_files, acc_dirs;
FILINFO Finfo;
DIR  dir;
FATFS Fatfs[_VOLUMES];
FIL fileR;
// BYTE Buff[BUFSIZE] __attribute__ ((aligned (4))) ;
__IO uint8_t Command_index = 0;
UINT nTextFile; // TXT ファイルの数
FATFS *fs;  /* Pointer to file system object */

#if _USE_LFN
char Lfname[512];
#endif
char OutPutFName[32];
char TmpOutPutFName[32];
uint8_t flgSAVING = 0;

void getOutPutFName(char * fn,UINT n)
{ 
	fn[0] = 'd';
	fn[1] = 'a';
	fn[2] = 't';
	fn[3] = 'a';
	fn[4] = '0' + (n / 1000) % 10;
	fn[5] = '0' + (n / 100) % 10;
	fn[6] = '0' + (n / 10) % 10;
	fn[7] = '0' + (n / 1) % 10;
	fn[8] = '.';
	fn[9] = 't';
	fn[10] = 'x';
	fn[11] = 't';
	fn[12] = 0;
}

uint32_t get_fattime (void)
{
  uint32_t res;
  /* See rtc_support.h */
  RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);  
  RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
  
  res =  (( (uint32_t)ts_year + (2000 - 1980)) << 25)
      | ((uint32_t)(ts_mon) << 21)
      | ((uint32_t)ts_mday << 16)
      | (uint32_t)(ts_hour << 11)
      | (uint32_t)(ts_min << 5)
      | (uint32_t)(ts_sec);
  return res;
}

static void put_rc (FRESULT rc)
{
  const char *str =
    "OK\0" "DISK_ERR\0" "INT_ERR\0" "NOT_READY\0" "NO_FILE\0" "NO_PATH\0"
    "INVALID_NAME\0" "DENIED\0" "EXIST\0" "INVALID_OBJECT\0" "WRITE_PROTECTED\0"
    "INVALID_DRIVE\0" "NOT_ENABLED\0" "NO_FILE_SYSTEM\0" "MKFS_ABORTED\0" "TIMEOUT\0"
    "LOCKED\0" "NOT_ENOUGH_CORE\0" "TOO_MANY_OPEN_FILES\0";
  FRESULT i;

