madnoda/stm32f4-glcd-logger/src/main.c
  for (i = 0; i != rc && *str; i++) {
    while (*str++) ;
  }
  glcd_Puts(" rc=");
  glcd_PutsUint((UINT)rc);
  glcd_Puts("FR_");
  glcd_Puts(str);
  glcd_Puts("\r\n");
}

static FRESULT scan_files (
  char* path /* Pointer to the path name working buffer */
)
{
  DIR dirs;
  FRESULT res;
  BYTE i;
  char *fn;
  if ((res = f_opendir(&dirs, path)) == FR_OK) {
    i = strlen(path);
    while (((res = f_readdir(&dirs, &Finfo)) == FR_OK) && Finfo.fname[0]){
      if (_FS_RPATH && Finfo.fname[0] == '.') continue;
#if _USE_LFN
      fn = *Finfo.lfname ? Finfo.lfname : Finfo.fname;
#else
      fn = Finfo.fname;
#endif
      if (Finfo.fattrib & AM_DIR) {
        acc_dirs++;
        *(path+i) = '/';
        strcpy(path+i+1, fn);
        res = scan_files(path);
        *(path+i) = '\0';
        if (res != FR_OK) break;
      } else {
        acc_files++;
        acc_size += Finfo.fsize;
      }
    }
  }
  return res;
}

FRESULT initSD()
{
  BYTE res;
  long p2;
  static const BYTE ft[] = {0, 12, 16, 32};

#if _USE_LFN
  Finfo.lfname = Lfname;
  Finfo.lfsize = sizeof(Lfname);
#endif
  f_mount(0, &Fatfs[0]);
  glcd_Puts(" _MAX_SS : ");
  glcd_PutsInt(_MAX_SS);
  glcd_Puts("\r\n");
  glcd_Puts(" FatFs module test terminal for ");
  glcd_Puts(MPU_SUBMODEL);
  glcd_Puts("\r\n");
  glcd_Puts(_USE_LFN ? " LFN Enabled" : " LFN Disabled");
  glcd_Puts(", Code page: ");
  glcd_PutsUint(_CODE_PAGE);
  glcd_Puts("\r\n");
  res = f_getfree("", (DWORD*)&p2, &fs);
  if (res) {
    put_rc(res);
  } else {
   	glcd_Puts(" FAT type = FAT");
    glcd_PutsUint(ft[fs->fs_type & 3]);
   	glcd_Puts("\r\n Bytes/Cluster = ");
    glcd_PutsUint((DWORD)fs->csize * 512);
   	glcd_Puts("\r\n Number of FATs = ");
    glcd_PutsUint((WORD)fs->n_fats);
   	glcd_Puts("\r\n");
   	glcd_Puts(" Root DIR entries = ");
    glcd_PutsUint(fs->n_rootdir);
   	glcd_Puts("\r\n Sectors/FAT = ");
    glcd_PutsInt(fs->fsize);
   	glcd_Puts("\r\n Number of clusters ="); 
    glcd_PutsInt((DWORD)fs->n_fatent - 2);
   	glcd_Puts("\r\n");
   	glcd_Puts(" FAT start (lba) = ");
    glcd_PutsInt(fs->fatbase);
   	glcd_Puts("\r\n DIR start (lba,clustor) = ");
    glcd_PutsInt(fs->dirbase);
   	glcd_Puts("\r\n Data start (lba) = ");
    glcd_PutsInt(fs->database);
   	glcd_Puts("\r\n\r\n ...");
    acc_size = acc_files = acc_dirs = 0;
    Finfo.lfname = Lfname;
    Finfo.lfsize = sizeof(Lfname);
    res = scan_files("");
    if (res) {
      put_rc(res);
    } else {
      glcd_Puts("\r\n ");
      glcd_PutsUint(acc_files);
      glcd_Puts(" files,"); 
      glcd_PutsInt(acc_size);
      glcd_Puts("bytes.\r\n ");
      glcd_PutsUint(acc_dirs);
      glcd_Puts(" folders.\r\n ");
      glcd_PutsInt((fs->n_fatent - 2) * (fs->csize / 2));
      glcd_Puts(" KB total disk space.\r\n ");
      glcd_PutsInt(p2 * (fs->csize / 2));
      glcd_Puts(" KB available.\r\n");
    }
  }
  return res;
}

char upper(char c)
{
  if ((c >= 'a') && (c <= 'z'))
    return c - 'a' + 'A';
  return c;
}

int isEx(char *filename,char * ex)
{
  int p1,p2;
  p1 = 0;
  while ((filename[p1] != 0) && (filename[p1] != '.')) {
    p1++;
  }
  if (filename[p1] == 0)
    return 0;
  p1++;
  if (filename[p1] == 0)
    return 0;
  p2 = 0;
  while ((filename[p1] != 0) && (ex[p2] != 0)) {
    if (upper(filename[p1]) != upper(ex[p2]))
      return 0;
    p1++;
    p2++;
  }
  if ((filename[p1] == 0) && (ex[p2] == 0))
    return 1;
  return 0;
}

FRESULT lsSD()
{
  BYTE res;
  long p1, p2;
  UINT s1, s2;
  res = f_getfree("", (DWORD*)&p2, &fs);// testcode
  res = f_opendir(& dir, "");
  if (res) {
    put_rc(res);
  } else {
    p1 = s1 = s2 = 0;
    nTextFile = 0;
    for(;;) {
      res = f_readdir(& dir, &Finfo);
      if ((res != FR_OK) || !Finfo.fname[0]) break;
      if (Finfo.fattrib & AM_DIR) {
        s2++;
      } else {
        s1++; p1 += Finfo.fsize;
        if (isEx(&(Finfo.fname[0]),"TXT")) {
          nTextFile++;
        }
      }
      glcd_Puts(" ");
      glcd_PutChar((Finfo.fattrib & AM_DIR) ? (0x8000|'D'):(0x8000|'-'));
      glcd_PutChar((Finfo.fattrib & AM_RDO) ? (0x8000|'R'):(0x8000|'-'));
      glcd_PutChar((Finfo.fattrib & AM_HID) ? (0x8000|'H'):(0x8000|'-'));
      glcd_PutChar((Finfo.fattrib & AM_SYS) ? (0x8000|'S'):(0x8000|'-'));
      glcd_PutChar((Finfo.fattrib & AM_ARC) ? (0x8000|'A'):(0x8000|'-'));
      glcd_PutChar(0x8000 | ' ');
      glcd_PutsUint((Finfo.fdate >> 9) + 1980);
      glcd_PutChar(0x8000 | '/');
      glcd_PutsUint8((Finfo.fdate >> 5) & 15);
      glcd_PutChar(0x8000 | '/');
      glcd_PutsUint8(Finfo.fdate & 31);
      glcd_PutChar(0x8000 | ' ');
      glcd_PutsUint8(Finfo.ftime >> 11);
      glcd_PutChar(0x8000 | ':');
      glcd_PutsUint8((Finfo.ftime >> 5) & 63);
      glcd_PutChar(0x8000 | ' ');
      glcd_PutsInt(Finfo.fsize);
      glcd_Puts("  ");
      glcd_Puts(&(Finfo.fname[0]));
#if _USE_LFN
      for (p2 = strlen(Finfo.fname); p2 < 14; p2++)
       	glcd_Puts(" ");
      glcd_Puts(Lfname);
      glcd_Puts("\r\n");
#else
      glcd_Puts("\r\n");
#endif
    }
   	glcd_Puts(" "); 
    glcd_PutsUint(s1);
   	glcd_Puts(" File(s),"); 
    glcd_PutsInt(p1);
   	glcd_Puts(" bytes total\r\n ");
    glcd_PutsUint(s2);
   	glcd_Puts("  dir(s)");
    res = f_getfree("", (DWORD*)&p1, &fs);
    if (res == FR_OK) {
     	glcd_Puts(", ");
		if (p1 * fs->csize/2 > (1024 * 1024)) {
		  glcd_PutsInt(p1 * fs->csize /(2048*1-24));
     	  glcd_Puts(" Mbytes free\r\n");
		} else 
		if (p1 * fs->csize/2 > 1024) {
		  glcd_PutsInt(p1 * fs->csize /2048);
     	  glcd_Puts(" k bytes free\r\n");
		} else {
		  glcd_PutsInt(p1 * fs->csize /2);
     	  glcd_Puts(" k bytes free\r\n");
		}
    } else {
      put_rc(res);
    }
   	glcd_Puts(" TXT File ");
    glcd_PutsUint(nTextFile);
   	glcd_Puts("\r\n");
  }
  return res;
}

FIL file;
#define FBUF_SIZE 512		// SDカードへ書き込むためのバッファサイズ
// #define RING_BUF_SIZE 48
#define RING_BUF_SIZE 32
uint8_t ring_buffer[RING_BUF_SIZE][FBUF_SIZE];
volatile uint8_t ring_buffer_p_in  = 0;
volatile uint8_t ring_buffer_p_out = 0;
UINT pBuf = 0;
UINT flgSDcard = 0;

void putcSD(uint8_t data)
{
	ring_buffer[ring_buffer_p_in][pBuf] = data;
	pBuf++;
	if (pBuf >= FBUF_SIZE) {
		pBuf = 0;
		ring_buffer_p_in ++;
		if (ring_buffer_p_in >= RING_BUF_SIZE) {
			ring_buffer_p_in = 0;
		}
	}
}

void putdaSD(uint8_t data0,uint8_t data1,uint8_t data2,uint8_t data3)
{
	if (pBuf == 0) {
		RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);  
		RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
		ring_buffer[ring_buffer_p_in][pBuf++] = ts_year;
		ring_buffer[ring_buffer_p_in][pBuf++] = ts_mon;
		ring_buffer[ring_buffer_p_in][pBuf++] = ts_mday;
		ring_buffer[ring_buffer_p_in][pBuf++] = ts_hour;
		ring_buffer[ring_buffer_p_in][pBuf++] = ts_min;
		ring_buffer[ring_buffer_p_in][pBuf++] = ts_sec;
		while (pBuf < 12)
			ring_buffer[ring_buffer_p_in][pBuf++] = 0;
	}
	ring_buffer[ring_buffer_p_in][pBuf++] = data0;
	ring_buffer[ring_buffer_p_in][pBuf++] = data1;
	ring_buffer[ring_buffer_p_in][pBuf++] = data2;
	ring_buffer[ring_buffer_p_in][pBuf++] = data3;
	if (pBuf >= FBUF_SIZE) {
		pBuf = 0;
		ring_buffer_p_in ++;
		if (ring_buffer_p_in >= RING_BUF_SIZE) {
			ring_buffer_p_in = 0;
		}
	}
}

