madnoda/stm32f4-glcd-logger/src/main.c
void initADC();
//uint16_t adc1,adc2;

uint8_t d[8];
uint8_t f[8];
//uint32_t bv;

char input_str[1024];
int input_p,input_k;
#ifdef USE_KANJI
char output_str[1536];
#endif
int flgChangeGLCD = 0;

uint8_t psw;
enum eDISP_STATUS { LOGICIN, ANALOGIN, SERIALIN, SETTING };
enum eDISP_STATUS disp_status = LOGICIN;
uint8_t flgTRIG = 1;

uint16_t tmp_year;
uint8_t tmp_mon,tmp_day;
uint8_t tmp_hour,tmp_min,tmp_sec;
enum eSETTING_STATUS { SET_DATA_KIND,START_SAVE,SET_YEAR, SET_MON, SET_DAY, SET_HOUR, SET_MIN, SET_SEC,CLOCKSET };
//enum eSETTING_STATUS { SET_DIGITAL,SET_ANALOG,SET_SERIAL,START_SAVE,SET_YEAR, SET_MON, SET_DAY, SET_HOUR, SET_MIN, SET_SEC,CLOCKSET };
enum eSETTING_STATUS setting_status = SET_DATA_KIND;

uint8_t flgDATAKIND = 1;
uint8_t tmp_flgDATAKIND = 0;

#ifdef SERIAL_DEBUG
int serial_debug_c = 0;
#endif


int main(void)
{
	int i,j,n,t,x,y;
	uint16_t c;
	UINT fbuflen;
//	uint8_t work;
//	bv = RTC_ReadBackupRegister(RTC_BKP_DR2);
	/* Set Basis System */
	Set_System();
	/* Set SysTickCounter for _delay_ms(); */
	SysTickInit(INTERVAL);
	gpioInit();
	initADC();
	fifo_clear();
	glcd_Init();
	glcd_BufClear(1);
	conio_init(UART_DEFAULT_NUM,UART_BAUDLATE);
#ifdef SERIAL_DEBUG
	serial_debug_c = 0;
#endif
	input_p = 0;
	input_k = 0;
	flgChangeGLCD = 0;
	RTC_Configuration(0);
//	set_RTC(2013,4,11,20,55,0);
	glcd_x = 0;
	glcd_y = 0;
	flgUpdate = 1;
 	glcd_Puts("\r\n");
 	glcd_Puts(" Welcome to");
 	glcd_Puts(MPU_SUBMODEL);
 	glcd_Puts("test program !!\r\n");
 	glcd_Puts(" Version");
 	glcd_Puts(APP_VERSION);
 	glcd_Puts("!!\r\n");
 	glcd_Puts(" Build Date : ");
 	glcd_Puts(__DATE__);
 	glcd_Puts("\r\n");
	for (i = 0;i < 8;i++) {
		glcd_TransFromBuf();
		_delay_ms(100);
	}
	if ((!initSD()) && (lsSD() == FR_OK)) {
		getOutPutFName(OutPutFName,nTextFile);
		glcd_Puts(" Output Filename :");
		glcd_Puts(OutPutFName);
		glcd_Puts("\r\n\r\n");
		flgSDcard = 1;
		ring_buffer_p_in  = 0;
		ring_buffer_p_out = 0;
		pBuf = 0;
	} else {
		glcd_Puts("Error: NO SD Card!!\r\n");
		flgSDcard = 0;
    }
	for (i = 0;i < 30;i++) {
		if (pushSW()) i = 30;
		glcd_TransFromBuf();
		_delay_ms(100);
	}

	/* Main Loop */
	while (1)
	{
		glcd_TransFromBuf();
		_delay_ms(10);
		psw = pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();
		_delay_ms(10);
		psw |= pushSW();

		switch (disp_status) {
			case LOGICIN:
				if (psw & 0x01) {
					disp_status ++;
				} else if (psw & 0x02) {
					flgTRIG ++;
					if (flgTRIG > 2)
						flgTRIG = 0;
				} else if (psw & 0x04) {
					switch (divMS) {
						case 5:
							break;
						case 10:
							divMS = 5;
							divC = 1;
							fifo_clear();
							break;
						case 20:
							divMS = 10;
							divC = 2;
							fifo_clear();
							break;
						case 50:
							divMS = 20;
							divC = 4;
							fifo_clear();
							break;
						case 100:
	
							divMS = 50;
							divC = 10;
							fifo_clear();
							break;
						case 200:
							divMS = 100;
							divC = 20;
							fifo_clear();
							break;
						case 500:
							divMS = 200;
							divC = 40;
							fifo_clear();
							break;
						case 1000:
							divMS = 500;
							divC = 100;
							fifo_clear();
							break;
					}
				} else if (psw & 0x08) {
					switch (divMS) {
						case 5:
							divMS = 10;
							divC = 2;
							fifo_clear();
							break;
						case 10:
							divMS = 20;
							divC = 4;
							fifo_clear();
							break;
						case 20:
							divMS = 50;
							divC = 10;
							fifo_clear();
							break;
						case 50:
							divMS = 100;
							divC = 20;
							fifo_clear();
							break;
						case 100:
							divMS = 200;
							divC = 40;
							fifo_clear();
							break;
						case 200:
							divMS = 500;
							divC = 100;
							fifo_clear();
							break;
						case 500:
							divMS = 1000;
							divC = 200;
							fifo_clear();
							break;
						case 1000:
							break;
					}
				} else if (psw & 0x80) {
				}
				break;
			case ANALOGIN:
				if (psw & 0x01) {
					disp_status ++;
					glcd_BufClear(1);
					glcd_x = 0;
					glcd_y = 0;
					flgUpdate = 0;
				} else if (psw & 0x02) {
					flgTRIG ++;
					if (flgTRIG > 2)
						flgTRIG = 0;
				} else if (psw & 0x04) {
					switch (divMS) {
						case 5:
							break;
						case 10:
							divMS = 5;
							divC = 1;
							fifo_clear();
							break;
						case 20:
							divMS = 10;
							divC = 2;
							fifo_clear();
							break;
						case 50:
							divMS = 20;
							divC = 4;
							fifo_clear();
							break;
						case 100:
							divMS = 50;
							divC = 10;
							fifo_clear();
							break;
						case 200:
							divMS = 100;
							divC = 20;
							fifo_clear();
							break;
						case 500:
							divMS = 200;
							divC = 40;
							fifo_clear();
							break;
						case 1000:
							divMS = 500;
							divC = 100;
							fifo_clear();
							break;
					}
				} else if (psw & 0x08) {
					switch (divMS) {
						case 5:
							divMS = 10;
							divC = 2;
							fifo_clear();
							break;
						case 10:
							divMS = 20;
							divC = 4;
							fifo_clear();
							break;
						case 20:
							divMS = 50;
							divC = 10;
							fifo_clear();
							break;
						case 50:
							divMS = 100;
							divC = 20;
							fifo_clear();
							break;
						case 100:
							divMS = 200;
							divC = 40;
							fifo_clear();
							break;
						case 200:
							divMS = 500;
							divC = 100;
							fifo_clear();
							break;
						case 500:
							divMS = 1000;
							divC = 200;
							fifo_clear();
							break;
						case 1000:
							break;
					}
				}
				break;
			case SERIALIN:
				if (psw & 0x01) {
					disp_status ++;
					tmp_flgDATAKIND = flgDATAKIND;
					RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);  
					RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
					tmp_year=2000+ts_year;
					tmp_mon=ts_mon;
					tmp_day=ts_mday;
					tmp_hour=ts_hour;
					tmp_min=ts_min;
					tmp_sec=ts_sec;
					if (flgSDcard) {
						setting_status = SET_DATA_KIND;
					} else {
						setting_status = SET_YEAR;
					}
				}
				break;
			case SETTING:
				if (psw & 0x01) {
					disp_status = LOGICIN;
				} else if (psw & 0x04) {
					if (flgSDcard) {
						if (setting_status == SET_DATA_KIND) {
							setting_status = CLOCKSET;
						} else {
							setting_status --;
						}
					} else {
						if (setting_status == SET_YEAR) {
							setting_status = CLOCKSET;
						} else {
							setting_status --;
						}
					}
				} else if (psw & 0x08) {
					if (setting_status == CLOCKSET) {
						if (flgSDcard) {
							setting_status = SET_DATA_KIND;
						} else {
							setting_status = SET_YEAR;
						}
					} else {
						setting_status ++;
					}
				} else if (psw & 0x10) {
					switch (setting_status) {
						case SET_DATA_KIND:
							if (tmp_flgDATAKIND) {
								tmp_flgDATAKIND = 0;
							} else {
								tmp_flgDATAKIND = 1;
							}
							break;
						case SET_YEAR:
							tmp_year --;
							break;
						case SET_MON:
							tmp_mon --;
							if(tmp_mon == 0) {
								tmp_mon = 12;
							}
							break;
						case SET_DAY:
							tmp_day --;
							if(tmp_day == 0) {
								tmp_day = 31;
							}
							break;
						case SET_HOUR:
							if(tmp_hour == 0) {
								tmp_hour =23;
							} else {
								tmp_hour --;
							}
							break;
						case SET_MIN:
							if(tmp_min == 0) {
								tmp_min =59;
							} else {
								tmp_min --;
							}
							break;
						case SET_SEC:
							if(tmp_sec == 0) {
								tmp_sec =59;
							} else {
								tmp_sec --;
							}
							break;
					}
				} else if (psw & 0x20) {
					switch (setting_status) {
						case SET_DATA_KIND:
							if (tmp_flgDATAKIND) {
								tmp_flgDATAKIND = 0;
							} else {
								tmp_flgDATAKIND = 1;
							}
							break;
						case SET_YEAR:
							tmp_year ++;
							break;
						case SET_MON:
							tmp_mon ++;
							if(tmp_mon == 13) {
								tmp_mon = 1;
							}
							break;
						case SET_DAY:
							tmp_day ++;
							if(tmp_day == 32) {
								tmp_day = 1;
							}
							break;
						case SET_HOUR:
							if(tmp_hour == 23) {
								tmp_hour = 0;
							} else {
								tmp_hour ++;
							}
							break;
						case SET_MIN:
							if(tmp_min == 59) {
								tmp_min = 0;
							} else {
								tmp_min ++;
							}
							break;
						case SET_SEC:
							if(tmp_sec == 59) {
								tmp_sec = 0;
							} else {
								tmp_sec ++;
							}
							break;
					}
				} else if (psw & 0x80) {
					if (setting_status == START_SAVE) {
						n = ring_buffer_p_in - ring_buffer_p_out;
						if (flgSAVING == 0) {
							flgDATAKIND = tmp_flgDATAKIND;
							getOutPutFName(OutPutFName,nTextFile);
							f_open(&file,OutPutFName,FA_CREATE_ALWAYS | FA_WRITE);
							f_close(&file);
							flgSAVING = 1;
							ring_buffer_p_in  = 0;
							ring_buffer_p_out = 0;
							pBuf = 0;
						} else if ((flgSAVING) && (n > 0)) {
							f_open(&file,OutPutFName,FA_READ|FA_WRITE);
							f_lseek(&file,f_size(&file));
							while (n > 0) {
								if (ring_buffer_p_out + n < RING_BUF_SIZE) {
									f_write (&file,ring_buffer[ring_buffer_p_out],n * FBUF_SIZE,&fbuflen);
									ring_buffer_p_out += n;
									n = 0;
								} else {
									f_write (&file,ring_buffer[ring_buffer_p_out],(RING_BUF_SIZE - ring_buffer_p_out) * FBUF_SIZE,&fbuflen);
									n -= (RING_BUF_SIZE - ring_buffer_p_out);
									ring_buffer_p_out = 0;	
								}
							}
							f_close(&file);
							flgSAVING = 0;
							nTextFile++;
						} else {
							flgSAVING = 0;
							nTextFile++;
						}
					}
					if (setting_status == CLOCKSET) {
						RTC_Configuration(1);
						set_RTC(tmp_year,tmp_mon,tmp_day,tmp_hour,tmp_min,tmp_sec);
					}
				}
				break;
		}

		if (disp_status != SERIALIN) {
			glcd_BufClear(1);
		}
		switch (disp_status) {
			case LOGICIN:
				for (i = 0;i < 8;i++) {
					glcd_PutCharAt( 8,i * stepY + offsetYC,0x8000|('1'+i));
					glcd_PutCharAt(16,i * stepY + offsetYC,0x8000|'c');
					glcd_PutCharAt(24,i * stepY + offsetYC,0x8000|'h');
				}
				j = -divMS;
				for (i = 32;i < 400;i += 50) {
					glcd_Vline(i,j);
					j += divMS;
				}
				if (flgTRIG == 0) {
					t = fifo_in - 400;
					if (t < 0) t += 2000;
				} else {
					t = fifo_in - 800;
					if (t < 0) t += 2000;
					if (flgTRIG == 1) {
						while ((t != fifo_in) && (fifo[t] & 0x01)) {
							t++;
							if (t >= 2000) t = 0;
						}
						while ((t != fifo_in) && (!(fifo[t] & 0x01))) {
							t++;
							if (t >= 2000) t = 0;
						}
						if (t == fifo_in) {
							t = fifo_in - 400;
							if (t < 0) t += 2000;
						} else {
							t = t - 42;
							if (t < 0) t += 2000;
						}
					} else {
						while ((t != fifo_in) && (!(fifo[t] & 0x01))) {
							t++;
							if (t >= 2000) t = 0;
						}
						while ((t != fifo_in) && (fifo[t] & 0x01)) {
							t++;
							if (t >= 2000) t = 0;
						}
						if (t == fifo_in) {
							t = fifo_in - 400;
							if (t < 0) t += 2000;
						} else {
							t = t - 42;
							if (t < 0) t += 2000;
						}
					}
				}
				for (i = 0;i < 8;i++) {
					d[i] = 0;
				}
				for (x = 40;x < 400;x++) {
					for (i = 0;i < 8;i++) {
						d[i] = d[i] >> 1;
						if (fifo[t] & (0x01<<i)) {
							d[i] |= 0x80;
						}
						if (x != 40) {
							if (((fifo[t] >>i)&0x01)^f[i]) {
								for(y=i*stepY+offsetYH;y<=i*stepY+offsetYL;y++)
									glcd_setLine(x,y,~(0x01<<(x%8)));
							}
						}
						if (fifo[t] & (0x01<<i)) {
							f[i] = 1;
						} else {
							f[i] = 0;
						}
						if (x % 8 == 7) {
							glcd_setLine(x,i * stepY + offsetYL,d[i]);
							glcd_setLine(x,i * stepY + offsetYH,~d[i]);
						}
					}
					t++;
					if (t >= 2000) t = 0;
				}
				break;

			case ANALOGIN:
				for (i = 0;i < 3;i++) {
					glcd_PutCharAt(8,i*stepYA+offsetYCA+stepYA/2,0x8000|('1'+i));
					glcd_PutCharAt(16,i*stepYA+offsetYCA+stepYA/2,0x8000|'c');
					glcd_PutCharAt(24,i*stepYA+offsetYCA+stepYA/2,0x8000|'h');
				}
				j = -divMS;
				for (i = 32;i < 400;i += 50) {
					glcd_Vline(i,j);
					j += divMS;
				}
				if (flgTRIG == 0) {
					t = fifo_in - 400;
					if (t < 0) t += 2000;
				} else {
					t = fifo_in - 800;
					if (t < 0) t += 2000;
					if (flgTRIG == 1) {
						while ((t != fifo_in) && (fifoa1[t] >= 0x80)) {
							t++;
							if (t >= 2000) t = 0;
						}
						while ((t != fifo_in) && (!(fifoa1[t] >= 0x80))) {
							t++;
							if (t >= 2000) t = 0;
						}
						if (t == fifo_in) {
							t = fifo_in - 400;
							if (t < 0) t += 2000;
						} else {
							t = t - 42;
							if (t < 0) t += 2000;
						}
					} else {
						while ((t != fifo_in) && (!(fifoa1[t] >= 0x80))) {
							t++;
							if (t >= 2000) t = 0;
						}
						while ((t != fifo_in) && (fifoa1[t] >= 0x80)) {
							t++;
							if (t >= 2000) t = 0;
						}
						if (t == fifo_in) {
							t = fifo_in - 400;
							if (t < 0) t += 2000;
						} else {
							t = t - 42;
							if (t < 0) t += 2000;
						}
					}
				}
				for (x = 40;x < 400;x++) {
					glcd_setDot(x,1*stepYA+offsetYCA-fifoa1[t]/5);
					glcd_setDot(x,2*stepYA+offsetYCA-fifoa2[t]/5);
					glcd_setDot(x,3*stepYA+offsetYCA-fifoa3[t]/5);
					t++;
					if (t >= 2000) t = 0;
				}
				break;
			case SERIALIN:
				break;
			case SETTING:
				glcd_PutsAt(48,30,"SETTING");
				if (flgSDcard) {
					glcd_PutsAt(64,46,"SD CARD:");
					if (flgSAVING) {
						glcd_PutsAt(128,46,"NOW SAVING:");
						glcd_PutsAt(216,46,OutPutFName);
					} else {
						glcd_PutsAt(128,46,"NOT SAVING");
					}
					glcd_PutsAt(128,62,"SAVEDATA DATA:");
					if (setting_status == SET_DATA_KIND) {
						if (tmp_flgDATAKIND == 0) {
							glcd_PutsAtINV(248,62,"DIGTAL & ANALOG");
						} else {
							glcd_PutsAtINV(248,62,"SERIAL");
						}
					} else {
						if (tmp_flgDATAKIND == 0) {
							glcd_PutsAt(248,62,"DIGTAL & ANALOG");
						} else {
							glcd_PutsAt(248,62,"SERIAL");
						}
					}
					if (flgSAVING) {
						if (setting_status == START_SAVE) {
							glcd_PutsAtINV(128,78,"STOP SAVE FILE");
						} else {
							glcd_PutsAt(128,78,"STOP SAVE FILE");
						}
					} else {
						getOutPutFName(TmpOutPutFName,nTextFile);
						if (setting_status == START_SAVE) {
							glcd_PutsAtINV(128,78,"START SAVE FILE:");
							glcd_PutsAtINV(256,78,TmpOutPutFName);
						} else {
							glcd_PutsAt(128,78,"START SAVE FILE:");
							glcd_PutsAt(256,78,TmpOutPutFName);
						}
					}
				} else {
					glcd_PutsAt(64,62,"NO SD Card!!");
				}
				RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);  
				RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
				glcd_Dec(88,110,4,2000+ts_year,1);
				glcd_PutCharAt(88+8*4,110,0x8000|'/');
				glcd_Dec(88+8*5,110,2,ts_mon,1);
				glcd_PutCharAt(88+8*7,110,0x8000|'/');
				glcd_Dec(88+8*8,110,2,ts_mday,1);
				glcd_PutCharAt(88+8*10,110,0x8000|' ');
				glcd_Dec(88+8*11,110,2,ts_hour,1);
				glcd_PutCharAt(88+8*13,110,0x8000|':');
				glcd_Dec(88+8*14,110,2,ts_min,1);
				glcd_PutCharAt(88+8*16,110,0x8000|':');
				glcd_Dec(88+8*17,110,2,ts_sec,1);
				glcd_Dec(88,126,4,tmp_year,setting_status != SET_YEAR);
				glcd_PutCharAt(88+8*4,126,0x8000|'/');
				glcd_Dec(88+8*5,126,2,tmp_mon,setting_status != SET_MON);
				glcd_PutCharAt(88+8*7,126,0x8000|'/');
				glcd_Dec(88+8*8,126,2,tmp_day,setting_status != SET_DAY);
				glcd_PutCharAt(88+8*10,126,0x8000|' ');
				glcd_Dec(88+8*11,126,2,tmp_hour,setting_status != SET_HOUR);
				glcd_PutCharAt(88+8*13,126,0x8000|':');
				glcd_Dec(88+8*14,126,2,tmp_min,setting_status != SET_MIN);
				glcd_PutCharAt(88+8*16,126,0x8000|':');
				glcd_Dec(88+8*17,126,2,tmp_sec,setting_status != SET_SEC);
				if (setting_status == CLOCKSET) {
					glcd_PutsAtINV(88+8*20,126,"CLOCK SET");
				} else {
					glcd_PutsAt(88+8*20,126,"CLOCK SET");
				}
			default:
				break;
		}
		input_k++;
		while((input_p < 1000) && ((c = getch_p16(UART_DEFAULT_NUM)) != 0xffff)){
			if (flgChangeGLCD == 0) flgChangeGLCD = 2;
			if (flgDATAKIND)
				putcSD(c);
			input_str[input_p++] = c;
			if ((c == '\r') || (c == '\n')) {
				if (disp_status == SERIALIN) {
					// UNIX系 は    LFのみ
					// WINDOWS系 は CR LF
					// MAC系 は     CRのみ
					// LF: 0x0A \n Control-J
					// CR: 0x0D \r Control-M
					if (c == '\n') { // UNIX用の修正
						input_str[input_p-1] = '\r';
						input_str[input_p++] = '\n';
					}
//					if (c == '\r') { // KERMIT用の修正
//						input_str[input_p-1] = '\r';
//						input_str[input_p++] = '\n';
//					}
					input_str[input_p++] = 0;
#ifdef USE_KANJI
					nkf(input_str, output_str, 1024, "-jW");
					glcd_Puts_Serial(output_str);
#else
					glcd_Puts_Serial(input_str);
#endif
#ifdef SERIAL_DEBUG
					serial_debug_c = 0;
#endif
				}
				input_p = 0;
			}
			input_k = 0;
		}
		if (disp_status == SERIALIN) {
			if ((input_p > 0) && (2 < input_k)) {
				input_str[input_p++] = 0;
#ifdef USE_KANJI
				nkf(input_str, output_str, 1024, "-jW");
				glcd_Puts_Serial(output_str);
#else
				glcd_Puts_Serial(input_str);
#endif
#ifdef SERIAL_DEBUG
				serial_debug_c = 0;
#endif
				input_p = 0;
				glcd_transChar();
				flgChangeGLCD = 0;
			}
			if((flgChangeGLCD) && (2 < input_k)) {
				glcd_transChar();
				flgChangeGLCD = 0;
			} else if(flgChangeGLCD == 1) {
				glcd_transChar();
				flgChangeGLCD = 0;
			} else if(flgChangeGLCD > 0) {
				flgChangeGLCD--;
			}
#ifdef SERIAL_DEBUG
			if (serial_debug_c >= 10) {
				glcd_transChar();
				glcd_Puts("*** NO SERIAL INPUT \r\n");
				glcd_Puts("*** RX_Tail:");
				glcd_PutsInt(USART1_Buf.RX_Tail);
				glcd_Puts(" RX_Head:");
				glcd_PutsInt(USART1_Buf.RX_Head);
				glcd_Puts("\r\n");
//				glcd_transChar();
				serial_debug_c = 0;
			} else {
				serial_debug_c++;
			}
#endif
		}

		if (input_p >= 1000)
			input_p = 0;

		if (flgSDcard) {
			if (flgDATAKIND)
				if (input_k > 100) { // 10 秒以上シリアル入力が無い時
					while(pBuf) putcSD('\n');
					input_k = 0;
				}
			n = ring_buffer_p_in - ring_buffer_p_out;
			if (n < 0) {
				n += RING_BUF_SIZE;
			}
/*
			if (n >= 2) {
				n -= 1;
			}
*/
			if ((flgSAVING) && (((input_k > 0) && (n > 0)) || (n > (RING_BUF_SIZE - 2)))) {

				f_open(&file,OutPutFName,FA_READ|FA_WRITE);
				f_lseek(&file,f_size(&file));
				while (n > 0) {
					if (ring_buffer_p_out + n < RING_BUF_SIZE) {
						f_write (&file,ring_buffer[ring_buffer_p_out],n * FBUF_SIZE,&fbuflen);
						ring_buffer_p_out += n;
						n = 0;
					} else {
						f_write (&file,ring_buffer[ring_buffer_p_out],(RING_BUF_SIZE - ring_buffer_p_out) * FBUF_SIZE,&fbuflen);
						n -= (RING_BUF_SIZE - ring_buffer_p_out);
						ring_buffer_p_out = 0;	
					}
				}
				f_close(&file);
			}
		}
	}
}		

// ADC Init
// ADC1 :PC0/ADC123_IN10
// ADC2 :PC1/ADC123_IN11
// ADC3 :PC2/ADC123_IN12

void initADC()
{
	GPIO_InitTypeDef	GPIO_InitStructure;
	ADC_InitTypeDef		ADC_InitStructure;
	ADC_CommonInitTypeDef ADC_CommonInitStructure;

